  
----------------------------------------------------------------------
  

helm repo add dynatrace \
https://raw.githubusercontent.com/Dynatrace/helm-charts/master/repos/stable


helm install dynatrace-oneagent-operator \
dynatrace/dynatrace-oneagent-operator -n\
dynatrace --values values.yaml


cat << EOF > values.yaml
platform: "kubernetes"
operator:
  image: ""
oneagent:
  name: "oneagent"
  apiUrl: "https://lrp86192.live.dynatrace.com/api"
  image: ""
  args:
    - --set-app-log-content-access=true
  env: {}
  nodeSelector: {}
  labels: {}
  skipCertCheck: false
  disableAgentUpdate: false
  enableIstio: false
  dnsPolicy: "" 
  resources: {}
  waitReadySeconds: null
  priorityClassName: ""
  serviceAccountName: ""
  proxy: ""
  trustedCAs: ""
secret:
  apiToken: "M1tDmWx7SSKwS-H8HB2ic"
  paasToken: "cjrY6cEmSK-Jp6R8GjLDL"
EOF 
  

helm pull dynatrace/dynatrace-oneagent-operator

kubectl create ns dynatrace

helm install dynatrace-oneagent-operator dynatrace-oneagent-operator-0.7.1.tgz  --values values.yaml --namespace dynatrace

To verify the current state of the OneAgent deployment, try:
  $ kubectl get pods -n dynatrace
  $ kubectl logs -f deployment/dynatrace-oneagent-operator -n dynatrace
  $ kubectl get oneagent oneagent -n dynatrace

helm get -a 
  

